Revit 2027 API
InitialLuminousIntensity Class
 This class encapsulates initial luminous intensity calculation.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Lighting.InitialIntensity
 Autodesk.Revit.DB.Lighting.InitialLuminousIntensity
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class InitialLuminousIntensity : InitialIntensity
Public Class InitialLuminousIntensity
	Inherits InitialIntensity
public ref class InitialLuminousIntensity : public InitialIntensity
type InitialLuminousIntensity =
    class
        inherit InitialIntensity
    end
The InitialLuminousIntensity type exposes the following members.
Constructors
Name | Description
InitialLuminousIntensity(Double) |  Creates an initial luminous intensity object with the given document and luminosity values.
InitialLuminousIntensity(InitialLuminousIntensity) |  Creates a copy of the given initial luminous intensity object
Top
Properties
Name | Description
InitialIntensityValue |  The calculated initial intensity value.
(Inherited from InitialIntensity)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from InitialIntensity)
Luminosity |  The luminosity value.
Top
Methods
Name | Description
Clone |  Creates a copy of the InitialIntensity derived object.
(Inherited from InitialIntensity)
Dispose
(Inherited from InitialIntensity)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB.Lighting Namespace